In [42]:
import pandas as pd
import numpy as np
import seaborn as sns

df = sns.load_dataset('titanic')

print(df.info())
##밑의 자료 요약본을 보시면 총 891개의 데이터가 있는데 중간중간에 그에 못 미치는 숫자를 가진 열이 있습니다.
##이런 열들이 결측치를 가진 열들입니다.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB
None

In [4]:
nan_deck=df['deck'].value_counts(dropna = False)
nan_deck
##value_counts라느 메소드를 통해 몇개의 결측치를 가지고 있는지 알 수 있습니다.
##이때 dropna옵션을 False라고 해야 결측치를 포함한 개수를 보여주고 True라면 결측치를 제외한 개수만을 보여줍니다.

NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: deck, dtype: int64

In [18]:
##innull()은 결측치를 True로, notnull()은 결측치를 제외힌 값을 True로 보여줍니다.
print(df.head().isnull())
print(df.head().notnull())
print("\n")
print(df.isnull().sum(axis=0))

   survived  pclass    sex    age  sibsp  parch   fare  embarked  class  \
0     False   False  False  False  False  False  False     False  False
1     False   False  False  False  False  False  False     False  False
2     False   False  False  False  False  False  False     False  False
3     False   False  False  False  False  False  False     False  False
4     False   False  False  False  False  False  False     False  False

     who  adult_male   deck  embark_town  alive  alone
0  False       False   True        False  False  False
1  False       False  False        False  False  False
2  False       False   True        False  False  False
3  False       False  False        False  False  False
4  False       False   True        False  False  False
   survived  pclass   sex   age  sibsp  parch  fare  embarked  class   who  \
0      True    True  True  True   True   True  True      True   True  True
1      True    True  True  True   True   True  True      True   True  True
2      True    True  True  True   True   True  True      True   True  True
3      True    True  True  True   True   True  True      True   True  True
4      True    True  True  True   True   True  True      True   True  True

   adult_male   deck  embark_town  alive  alone
0        True  False         True   True   True
1        True   True         True   True   True
2        True  False         True   True   True
3        True   True         True   True   True
4        True  False         True   True   True


survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [13]:
##deck은 누락 데이터의 비율이 매우 높으므로 역을 삭제하는것이 더 의미가 있습니다.
##dropna()메소드를 통해 해당 열을 삭제할 수 있습니다.
drop_df = df.dropna(axis = 1, thresh=500)
print(drop_df.columns)

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'embark_town', 'alive',
       'alone'],
      dtype='object')

In [20]:
##age에 대해서는 누락 데이터가 있는 행만을 지우는게 더 유리하다.
##subset옵션을 통해 열을 age로만 한정하여 삭제할 수 있다.
age_df = df.dropna(subset=['age'], how = 'any', axis = 0)
print(len(age_df))

714

In [21]:
##fillna()메소드로 누락 데이터를 다른 값으로 치환활 수 있습니다.
mean_age = df['age'].mean(axis=0)
df['age'].fillna(mean_age, inplace = True)
df.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.000000,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.000000,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.000000,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.000000,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.000000,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,29.699118,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.000000,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.000000,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.000000,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.000000,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

In [22]:
df = sns.load_dataset('titanic')

most_freq = df['embark_town'].value_counts(dropna = True).idxmax()          ##제일 빈도수가 높은 데이터를 반환합니다.
print(most_freq)
df['embark_town'].fillna(most_freq, inplace=True)
df['embark_town'][825:830]

Southampton

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829    Southampton
Name: embark_town, dtype: object

In [24]:
##누락데이터가 NaN으로 표시되지 않을 경우 replace()메소드를 사용합니다.
##예를 들어 df.replace('?', np.nan, inplace = True) 처럼 사용하면 됩니다.

##데이터 셋의 특성상 서로 이웃하고 있는 데이터끼리 유사성을 가질 가능성이 높습니다.
##따라서 누락 데이터의 앞, 뒤 데이터의 값으로 치환해주면 좋습니다.
##fillna()메소드에서 method='ffill', method='bfill'옵션을 사용하여 앞, 또는 뒤 데이터로 치환할 수 있습니다.
df = sns.load_dataset('titanic')
df['embark_town'].fillna(method = 'ffill', inplace=True)
df['embark_town'][825:830]

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829     Queenstown
Name: embark_town, dtype: object

In [28]:
##duplicated()메소드를 통해 중복 데이터를 확인할 수 있습니다.
df = pd.DataFrame({'a':[1,1,2,1,2], 'b':[1,1,1,2,2],'c':[1,1,2,2,2]})
df_dup = df.duplicated()
print(df_dup)
print("\n")
##전체가 아니라 열을 기준으로도 중복 검사를 할 수 있다.
col_dup = df['c'].duplicated()
print(col_dup)

0    False
1     True
2    False
3    False
4    False
dtype: bool


0    False
1     True
2    False
3     True
4     True
Name: c, dtype: bool

In [29]:
##drop_duplicates()메소드를 통해 중복 데이터를 삭제할 수 있습니다.
df2 = df.drop_duplicates()
df2

   a  b  c
0  1  1  1
2  2  1  2
3  1  2  2
4  2  2  2

In [30]:
##subset옵션을 통해 특정 열에 대해서만 중복을 확인하여 제거할 수 있습니다.
df3 = df.drop_duplicates(subset=['b','c'])
df3

   a  b  c
0  1  1  1
2  2  1  2
3  1  2  2

In [33]:
##같은 데이터셋 안에서 서로 다른 측정 단위를 사용한다면 전체 데이터의 일관성 측면에서 문세가 발생합니다.
##따라서 측정 단위를 동일하게 맞출 필요가 있습니다.

df = pd.read_csv("./auto-mpg.csv", header = None)
df.columns = ['mpg', 'cylinders','displacement','horsepower','weight','acceleration','model year','origin','name']

mpg_to_kpl = 1.60934/3.78541

df['kpl'] = (df['mpg']*mpg_to_kpl).round(2)
df.head(5)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,name,kpl
0,18.0,8,307.0,130.0,3504.0,12.0,70,1,chevrolet chevelle malibu,7.65
1,15.0,8,350.0,165.0,3693.0,11.5,70,1,buick skylark 320,6.38
2,18.0,8,318.0,150.0,3436.0,11.0,70,1,plymouth satellite,7.65
3,16.0,8,304.0,150.0,3433.0,12.0,70,1,amc rebel sst,6.80
4,17.0,8,302.0,140.0,3449.0,10.5,70,1,ford torino,7.23

In [55]:
##데이터를 보시면 horsepower는 숫자형, model year, origin은 범주형 자료형이 적절합니다.
##아래는 데이터프레임의 열의 자료형을 바꾸는 코드입니다.

df = pd.read_csv("./auto-mpg.csv", header = None)
df.columns = ['mpg', 'cylinders','displacement','horsepower','weight','acceleration','model year','origin','name']

df['horsepower'].unique()

array(['130.0', '165.0', '150.0', '140.0', '198.0', '220.0', '215.0',
       '225.0', '190.0', '170.0', '160.0', '95.00', '97.00', '85.00',
       '88.00', '46.00', '87.00', '90.00', '113.0', '200.0', '210.0',
       '193.0', '?', '100.0', '105.0', '175.0', '153.0', '180.0', '110.0',
       '72.00', '86.00', '70.00', '76.00', '65.00', '69.00', '60.00',
       '80.00', '54.00', '208.0', '155.0', '112.0', '92.00', '145.0',
       '137.0', '158.0', '167.0', '94.00', '107.0', '230.0', '49.00',
       '75.00', '91.00', '122.0', '67.00', '83.00', '78.00', '52.00',
       '61.00', '93.00', '148.0', '129.0', '96.00', '71.00', '98.00',
       '115.0', '53.00', '81.00', '79.00', '120.0', '152.0', '102.0',
       '108.0', '68.00', '58.00', '149.0', '89.00', '63.00', '48.00',
       '66.00', '139.0', '103.0', '125.0', '133.0', '138.0', '135.0',
       '142.0', '77.00', '62.00', '132.0', '84.00', '64.00', '74.00',
       '116.0', '82.00'], dtype=object)

In [56]:
##위 결과를 보시면 horswpower는 ?라는 값 때문에 숫자가 아닌, 문자열로 변환된 데이터입니다.
##따라서 결측치를 제거한 후, 숫자로 바꿀 수 있습니다.

df['horsepower'].replace('?', np.nan, inplace = True)
df.dropna(subset = ['horsepower'], axis = 0, inplace = True)
df['horsepower'] = df['horsepower'].astype('float')

print(df['horsepower'].dtypes)

float64

In [57]:
print(df['origin'].unique())

df['origin'].replace({1:'USA', 2: 'EU', 3:'JPN'}, inplace = True)
print(df['origin'].unique())
df['origin'] = df['origin'].astype('category')
print(df['origin'].dtypes)

[1 3 2]
['USA' 'JPN' 'EU']
category

In [62]:
##연속 데이터를 그대로 사용하기 보다는 일정한 구간으로 나눠서 분석하는 것이 효율적인 경우가 있습니다.
##판다스에서 cut함수를 통해 연속 데이터를 여러 구간으로 나누고, 범주형 데이터로 변환할 수 있습니다.

df = pd.read_csv("./auto-mpg.csv", header = None)
df.columns = ['mpg', 'cylinders','displacement','horsepower','weight','acceleration','model year','origin','name']

df['horsepower'].replace('?', np.nan, inplace = True)
df.dropna(subset = ['horsepower'], axis = 0, inplace = True)
df['horsepower'] = df['horsepower'].astype('float')

##데이터를 분할하려면 각 경계값이 필요합니다.
##numpy에서 histogram()이라는 함수를 지원하여 각 구간에 속하는 값의 개수와 경계값 리스트를 반환하는 기능을 합니다.

count, bin_dividers = np.histogram(df['horsepower'], bins = 3)
print(count, bin_dividers)
print("\n")

bin_names = ['저출력','보통출력','고출력']           
df['hp_bin'] = pd.cut(x = df['horsepower'],              ##데이터 배열
                    bins = bin_dividers,                 ##경계값 리스트
                    labels = bin_names,                  ##bin 이름
                    include_lowest=True)                ##각 구간 시작 값 포함

print(df[['horsepower', 'hp_bin']].head(15))

[257 103  32] [ 46.         107.33333333 168.66666667 230.        ]


    horsepower hp_bin
0        130.0   보통출력
1        165.0   보통출력
2        150.0   보통출력
3        150.0   보통출력
4        140.0   보통출력
5        198.0    고출력
6        220.0    고출력
7        215.0    고출력
8        225.0    고출력
9        190.0    고출력
10       170.0    고출력
11       160.0   보통출력
12       150.0   보통출력
13       225.0    고출력
14        95.0    저출력

In [63]:
##범주형 데이터를 사용하기 위해서는 0 또는 1로 표현된 더미 변수를 사용해야 합니다.
##여기서 0, 1은 어떤 특성이 있는지 없는지 여부만 표시합니다.
##범주형 데이터를 0, 1로 바꾸는 과정을 원핫인코딩이라고 합니다.

horsepower_dummies = pd.get_dummies(df['hp_bin'])
print(horsepower_dummies)

     저출력  보통출력  고출력
0      0     1    0
1      0     1    0
2      0     1    0
3      0     1    0
4      0     1    0
..   ...   ...  ...
393    1     0    0
394    1     0    0
395    1     0    0
396    1     0    0
397    1     0    0

[392 rows x 3 columns]

In [64]:
##각 변수에 들어있는 숫자 데이터의 상대적 크기 차이때문에 분석 결과가 달라질 수 있습니다.
##따라서 상대적인 크기 차이를 제거할 필요가 있습니다. 
##데이터 값을 동일한 크기 기준으로 나눈 비율을 정규화라고 합니다.
##여기서는 각 값을 그 열의 최댓값으로 나누었습니다. 

df = pd.read_csv("./auto-mpg.csv", header = None)
df.columns = ['mpg', 'cylinders','displacement','horsepower','weight','acceleration','model year','origin','name']

df['horsepower'].replace('?', np.nan, inplace = True)
df.dropna(subset = ['horsepower'], axis = 0, inplace = True)
df['horsepower'] = df['horsepower'].astype('float')

df['horsepower'] = df['horsepower']/abs(df['horsepower'].max())
df['horsepower'].head(10)

0    0.565217
1    0.717391
2    0.652174
3    0.652174
4    0.608696
5    0.860870
6    0.956522
7    0.934783
8    0.978261
9    0.826087
Name: horsepower, dtype: float64